# Задание 1: Создание класса Hero
#   1) Создайте класс Hero с атрибутами:
#
#      * name — имя.
#      * lvl — уровень.
#      * HP — количество жизни.
#   2) Добавьте метод introduce, который выводит информацию о герое в формате: \\\"Привет, меня зовут <Имя>, мой lvl <уровень> , мое HP <HP>\\\".
#
#   3) Создайте экземпляр класса Hero и вызовите метод introduce.
#
# Задание 2: Методы класса
#   1) В классе Hero добавьте метод is_adult, который проверяет, является ли герой уровнем выше 10. Если уровень больше или равен 10, метод должен возвращать True, иначе — False.
#
#   2) Создайте несколько экземпляров класса Hero с разными уровнями и вызовите метод is_adult для каждого.
#
# Задание 3: Репозиторий GItHub.
#   1) Создать репозиторий OOP-50-2
#
#   2) Привязать ваше домашнее задание к репозиторию OOP-50-2
#   3) сделать комит и залить ваше ДЗ на ваш репозиторий OOP-50-2
#
#   4) Прикрепить ссылку на ваше ДЗ